JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1176/port_flexspi_info.c
/*
 * Copyright 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "mtu.h"
#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"
#include "fsl_gpio.h"
#include "clock_config.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/////////////////////////////////////////////////////////////
enum _flexspi1_data_line_sel
{
    kFlexspi1_DataA_GPIO_SD_B2_11_08   = 0x00,
    kFlexspi1_DataA_GPIO_AD_23_20      = 0x01,

    kFlexspi1_DataB_GPIO_SD_B2_03_00   = 0x10,
    kFlexspi1_DataB_GPIO_AD_15_12      = 0x11,
};

enum _flexspi1_ss_b_sel
{
    kFlexspi1_Ss0A_GPIO_SD_B2_06   = 0x00,
    kFlexspi1_Ss0A_GPIO_AD_18      = 0x01,
    kFlexspi1_Ss1A_GPIO_SD_B1_02   = 0x02,

    kFlexspi1_Ss0B_GPIO_SD_B1_04   = 0x10,
    kFlexspi1_Ss1B_GPIO_AD_35      = 0x11,
    kFlexspi1_Ss1B_GPIO_SD_B1_03   = 0x12,
};

enum _flexspi1_sclk_sel
{
    kFlexspi1_SclkA_GPIO_SD_B2_07  = 0x00,
    kFlexspi1_SclkA_GPIO_AD_19     = 0x01,

    kFlexspi1_SclkB_GPIO_SD_B2_04  = 0x10,
    kFlexspi1_SclkB_GPIO_AD_16     = 0x11,
};

enum _flexspi1_dqs_sel
{
    kFlexspi1_DqsA_GPIO_SD_B2_05   = 0x00,
    kFlexspi1_DqsA_GPIO_AD_17      = 0x01,
    kFlexspi1_DqsA_GPIO_EMC_B2_18  = 0x02,

    kFlexspi1_DqsB_GPIO_SD_B1_05   = 0x10,
};

enum _flexspi1_rst_b_sel
{
    kFlexspi1_Rst_GPIO_SD_B1_00    = 0x00,
    kFlexspi1_Rst_GPIO_EMC_B1_40   = 0x01,
};

/////////////////////////////////////////////////////////////
enum _flexspi2_data_line_sel
{
    kFlexspi2_DataA_GPIO_EMC_B2_16_13       = 0x00,
    kFlexspi2_DataA_GPIO_SD_B1_05_02        = 0x01,
    kFlexspi2_DataA_GPIO_EMC_B2_20_17       = 0x02,

    kFlexspi2_DataB_GPIO_EMC_B2_06_03       = 0x10,
    kFlexspi2_DataB_GPIO_EMC_B1_41_B2_02_00 = 0x11,
};

enum _flexspi2_ss_b_sel
{
    kFlexspi2_Ss0A_GPIO_EMC_B2_11   = 0x00,
    kFlexspi2_Ss0A_GPIO_SD_B1_00    = 0x01,
    kFlexspi2_Ss1A_GPIO_AD_01       = 0x02,

    kFlexspi2_Ss0B_GPIO_EMC_B2_08   = 0x10,
    kFlexspi2_Ss1B_GPIO_AD_00       = 0x11,
};

enum _flexspi2_sclk_sel
{
    kFlexspi2_SclkA_GPIO_EMC_B2_10  = 0x00,
    kFlexspi2_SclkA_GPIO_SD_B1_01   = 0x01,

    kFlexspi2_SclkB_GPIO_EMC_B2_09  = 0x10,
};

enum _flexspi2_dqs_sel
{
    kFlexspi2_DqsA_GPIO_EMC_B2_12   = 0x00,

    kFlexspi2_DqsB_GPIO_EMC_B2_07   = 0x10,
};

#define MTU_USE_FSPI1_PORTA1                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI1;       \
        s_userConfig.mixspiPort = kFLEXSPI_PortA1;\
    }
#define MTU_USE_FSPI1_PORTA2                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI1;       \
        s_userConfig.mixspiPort = kFLEXSPI_PortA2;\
    }
#define MTU_USE_FSPI1_PORTB1                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI1;       \
        s_userConfig.mixspiPort = kFLEXSPI_PortB1;\
    }
#define MTU_USE_FSPI1_PORTB2                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI1;       \
        s_userConfig.mixspiPort = kFLEXSPI_PortB2;\
    }
#define MTU_USE_FSPI2_PORTA1                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI2;       \
        s_userConfig.mixspiPort = kFLEXSPI_PortA1;\
    }
#define MTU_USE_FSPI2_PORTA2                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI2;       \
        s_userConfig.mixspiPort = kFLEXSPI_PortA2;\
    }
#define MTU_USE_FSPI2_PORTB1                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI2;       \
        s_userConfig.mixspiPort = kFLEXSPI_PortB1;\
    }
#define MTU_USE_FSPI2_PORTB2                      \
    {                                             \
        s_userConfig.mixspiBase = FLEXSPI2;       \
        s_userConfig.mixspiPort = kFLEXSPI_PortB2;\
    }

#define PAD_CONFIG                     (0x0A)

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

   
/*******************************************************************************
 * Variables
 ******************************************************************************/

pin_info_t s_pinInfo[MTU_MAX_PINS];


/*******************************************************************************
 * Code
 ******************************************************************************/

void bsp_mixspi_pinmux_config(void *configPacket, bool isPintest, uint32_t pad_config)
{
    CLOCK_EnableClock(kCLOCK_Iomuxc);

    if (pad_config == 0)
    {
        pad_config = PAD_CONFIG;
    }
    else
    {
        pad_config = 0x0AU;
    }

    if (isPintest)
    {
        pin_unittest_packet_t *packet = (pin_unittest_packet_t *)configPacket;
        gpio_pin_config_t do_config = {kGPIO_DigitalOutput, 0, kGPIO_NoIntmode};
        memset(s_pinInfo, 0xFF, sizeof(s_pinInfo));
        if (packet->memConnection.instance == 1)
        {
            if (packet->pintestEn.option.B.dataLow4bit)
            {
                switch (packet->memConnection.dataLow4bit)
                {
                    case kFlexspi1_DataA_GPIO_SD_B2_11_08:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_08_GPIO10_IO17, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_09_GPIO10_IO18, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_10_GPIO10_IO19, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_11_GPIO10_IO20, 0U);
                        GPIO_PinInit(GPIO10, 17, &do_config);
                        GPIO_PinInit(GPIO10, 18, &do_config);
                        GPIO_PinInit(GPIO10, 19, &do_config);
                        GPIO_PinInit(GPIO10, 20, &do_config);
                        s_pinInfo[0].gpioGroup = 10;
                        s_pinInfo[0].gpioPin = 17;
                        s_pinInfo[1].gpioGroup = 10;
                        s_pinInfo[1].gpioPin = 18;
                        s_pinInfo[2].gpioGroup = 10;
                        s_pinInfo[2].gpioPin = 19;
                        s_pinInfo[3].gpioGroup = 10;
                        s_pinInfo[3].gpioPin = 20;
                        break;
                    case kFlexspi1_DataA_GPIO_AD_23_20:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_20_GPIO9_IO19, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_21_GPIO9_IO20, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_22_GPIO9_IO21, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_23_GPIO9_IO22, 0U);
                        GPIO_PinInit(GPIO9, 19, &do_config);
                        GPIO_PinInit(GPIO9, 20, &do_config);
                        GPIO_PinInit(GPIO9, 21, &do_config);
                        GPIO_PinInit(GPIO9, 22, &do_config);
                        s_pinInfo[0].gpioGroup = 9;
                        s_pinInfo[0].gpioPin = 19;
                        s_pinInfo[1].gpioGroup = 9;
                        s_pinInfo[1].gpioPin = 20;
                        s_pinInfo[2].gpioGroup = 9;
                        s_pinInfo[2].gpioPin = 21;
                        s_pinInfo[3].gpioGroup = 9;
                        s_pinInfo[3].gpioPin = 22;
                        break;
                    case kFlexspi1_DataB_GPIO_SD_B2_03_00:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_00_GPIO10_IO09, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_01_GPIO10_IO10, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_02_GPIO10_IO11, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_03_GPIO10_IO12, 0U);
                        GPIO_PinInit(GPIO10, 9, &do_config);
                        GPIO_PinInit(GPIO10, 10, &do_config);
                        GPIO_PinInit(GPIO10, 11, &do_config);
                        GPIO_PinInit(GPIO10, 12, &do_config);
                        s_pinInfo[0].gpioGroup = 10;
                        s_pinInfo[0].gpioPin = 9;
                        s_pinInfo[1].gpioGroup = 10;
                        s_pinInfo[1].gpioPin = 10;
                        s_pinInfo[2].gpioGroup = 10;
                        s_pinInfo[2].gpioPin = 11;
                        s_pinInfo[3].gpioGroup = 10;
                        s_pinInfo[3].gpioPin = 12;
                        break;
                    case kFlexspi1_DataB_GPIO_AD_15_12:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_12_GPIO9_IO11, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_13_GPIO9_IO12, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_14_GPIO9_IO13, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_15_GPIO9_IO14, 0U);
                        GPIO_PinInit(GPIO9, 11, &do_config);
                        GPIO_PinInit(GPIO9, 12, &do_config);
                        GPIO_PinInit(GPIO9, 13, &do_config);
                        GPIO_PinInit(GPIO9, 14, &do_config);
                        s_pinInfo[0].gpioGroup = 9;
                        s_pinInfo[0].gpioPin = 11;
                        s_pinInfo[1].gpioGroup = 9;
                        s_pinInfo[1].gpioPin = 12;
                        s_pinInfo[2].gpioGroup = 9;
                        s_pinInfo[2].gpioPin = 13;
                        s_pinInfo[3].gpioGroup = 9;
                        s_pinInfo[3].gpioPin = 14;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.ss_b)
            {
                switch (packet->memConnection.ss_b)
                {
                    case kFlexspi1_Ss0A_GPIO_SD_B2_06:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_06_GPIO10_IO15, 0U);
                        GPIO_PinInit(GPIO10, 15, &do_config);
                        s_pinInfo[4].gpioGroup = 10;
                        s_pinInfo[4].gpioPin = 15;
                        break;
                    case kFlexspi1_Ss0A_GPIO_AD_18:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_18_GPIO9_IO17, 0U);
                        GPIO_PinInit(GPIO9, 17, &do_config);
                        s_pinInfo[4].gpioGroup = 9;
                        s_pinInfo[4].gpioPin = 17;
                        break;
                    case kFlexspi1_Ss1A_GPIO_SD_B1_02:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_GPIO10_IO05, 0U);
                        GPIO_PinInit(GPIO10, 5, &do_config);
                        s_pinInfo[4].gpioGroup = 10;
                        s_pinInfo[4].gpioPin = 5;
                        break;
                    case kFlexspi1_Ss0B_GPIO_SD_B1_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_GPIO10_IO07, 0U);
                        GPIO_PinInit(GPIO10, 7, &do_config);
                        s_pinInfo[4].gpioGroup = 10;
                        s_pinInfo[4].gpioPin = 7;
                        break;
                    case kFlexspi1_Ss1B_GPIO_AD_35:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_35_GPIO10_IO02, 0U);
                        GPIO_PinInit(GPIO10, 2, &do_config);
                        s_pinInfo[4].gpioGroup = 10;
                        s_pinInfo[4].gpioPin = 2;
                        break;
                    case kFlexspi1_Ss1B_GPIO_SD_B1_03:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_03_GPIO10_IO06, 0U);
                        GPIO_PinInit(GPIO10, 6, &do_config);
                        s_pinInfo[4].gpioGroup = 10;
                        s_pinInfo[4].gpioPin = 6;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.sclk)
            {
                switch (packet->memConnection.sclk)
                {
                    case kFlexspi1_SclkA_GPIO_SD_B2_07:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_07_GPIO10_IO16, 0U);
                        GPIO_PinInit(GPIO10, 16, &do_config);
                        s_pinInfo[5].gpioGroup = 10;
                        s_pinInfo[5].gpioPin = 16;
                        break;
                    case kFlexspi1_SclkA_GPIO_AD_19:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_19_GPIO9_IO18, 0U);
                        GPIO_PinInit(GPIO9, 18, &do_config);
                        s_pinInfo[5].gpioGroup = 9;
                        s_pinInfo[5].gpioPin = 18;
                        break;
                    case kFlexspi1_SclkB_GPIO_SD_B2_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_04_GPIO10_IO13, 0U);
                        GPIO_PinInit(GPIO10, 13, &do_config);
                        s_pinInfo[5].gpioGroup = 10;
                        s_pinInfo[5].gpioPin = 13;
                        break;
                    case kFlexspi1_SclkB_GPIO_AD_16:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_16_GPIO9_IO15, 0U);
                        GPIO_PinInit(GPIO9, 15, &do_config);
                        s_pinInfo[5].gpioGroup = 9;
                        s_pinInfo[5].gpioPin = 15;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.dqs0)
            {
                switch (packet->memConnection.dqs0)
                {
                    case kFlexspi1_DqsA_GPIO_SD_B2_05:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_05_GPIO10_IO14, 0U);
                        GPIO_PinInit(GPIO10, 14, &do_config);
                        s_pinInfo[6].gpioGroup = 10;
                        s_pinInfo[6].gpioPin = 14;
                        break;
                    case kFlexspi1_DqsA_GPIO_AD_17:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_17_GPIO9_IO16, 0U);
                        GPIO_PinInit(GPIO9, 16, &do_config);
                        s_pinInfo[6].gpioGroup = 9;
                        s_pinInfo[6].gpioPin = 16;
                        break;
                    case kFlexspi1_DqsA_GPIO_EMC_B2_18:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_18_GPIO8_IO28, 0U);
                        GPIO_PinInit(GPIO8, 28, &do_config);
                        s_pinInfo[6].gpioGroup = 8;
                        s_pinInfo[6].gpioPin = 28;
                        break;
                    case kFlexspi1_DqsB_GPIO_SD_B1_05:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_GPIO10_IO08, 0U);
                        GPIO_PinInit(GPIO10, 8, &do_config);
                        s_pinInfo[6].gpioGroup = 10;
                        s_pinInfo[6].gpioPin = 8;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.dataHigh4bit)
            {
                switch (packet->memConnection.dataHigh4bit)
                {
                    case kFlexspi1_DataB_GPIO_SD_B2_03_00:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_00_GPIO10_IO09, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_01_GPIO10_IO10, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_02_GPIO10_IO11, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_03_GPIO10_IO12, 0U);
                        GPIO_PinInit(GPIO10, 9, &do_config);
                        GPIO_PinInit(GPIO10, 10, &do_config);
                        GPIO_PinInit(GPIO10, 11, &do_config);
                        GPIO_PinInit(GPIO10, 12, &do_config);
                        s_pinInfo[7].gpioGroup = 10;
                        s_pinInfo[7].gpioPin = 9;
                        s_pinInfo[8].gpioGroup = 10;
                        s_pinInfo[8].gpioPin = 10;
                        s_pinInfo[9].gpioGroup = 10;
                        s_pinInfo[9].gpioPin = 11;
                        s_pinInfo[10].gpioGroup = 10;
                        s_pinInfo[10].gpioPin = 12;
                        break;
                    case kFlexspi1_DataB_GPIO_AD_15_12:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_12_GPIO9_IO11, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_13_GPIO9_IO12, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_14_GPIO9_IO13, 0U);
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_15_GPIO9_IO14, 0U);
                        GPIO_PinInit(GPIO9, 11, &do_config);
                        GPIO_PinInit(GPIO9, 12, &do_config);
                        GPIO_PinInit(GPIO9, 13, &do_config);
                        GPIO_PinInit(GPIO9, 14, &do_config);
                        s_pinInfo[7].gpioGroup = 9;
                        s_pinInfo[7].gpioPin = 11;
                        s_pinInfo[8].gpioGroup = 9;
                        s_pinInfo[8].gpioPin = 12;
                        s_pinInfo[9].gpioGroup = 9;
                        s_pinInfo[9].gpioPin = 13;
                        s_pinInfo[10].gpioGroup = 9;
                        s_pinInfo[10].gpioPin = 14;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.dataTop8bit)
            {
            }
            if (packet->pintestEn.option.B.sclk_n)
            {
                switch (packet->memConnection.sclk_n)
                {
                    case kFlexspi1_SclkB_GPIO_SD_B2_04:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_04_GPIO10_IO13, 0U);
                        GPIO_PinInit(GPIO10, 13, &do_config);
                        s_pinInfo[19].gpioGroup = 10;
                        s_pinInfo[19].gpioPin = 13;
                        break;
                    case kFlexspi1_SclkB_GPIO_AD_16:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_AD_16_GPIO9_IO15, 0U);
                        GPIO_PinInit(GPIO9, 15, &do_config);
                        s_pinInfo[19].gpioGroup = 9;
                        s_pinInfo[19].gpioPin = 15;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.dqs1)
            {
                switch (packet->memConnection.dqs1)
                {
                    case kFlexspi1_DqsB_GPIO_SD_B1_05:
                        IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_GPIO10_IO08, 0U);
                        GPIO_PinInit(GPIO10, 8, &do_config);
                        s_pinInfo[20].gpioGroup = 10;
                        s_pinInfo[20].gpioPin = 8;
                        break;
                    default:
                        break;
                }
            }
            if (packet->pintestEn.option.B.rst_b)
            {
            }
        }
        else if (packet->memConnection.instance == 2)
        {

