JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1176/port_flexspi_info.c
        }
    }
    else
    {
        config_system_packet_t *packet = (config_system_packet_t *)configPacket;
        if (packet->memConnection.instance == 1)
        {
            switch (packet->memConnection.dataLow4bit)
            {
                case kFlexspi1_DataA_GPIO_SD_B2_11_08:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_08_FLEXSPI1_A_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_09_FLEXSPI1_A_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_10_FLEXSPI1_A_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_11_FLEXSPI1_A_DATA03, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_08_FLEXSPI1_A_DATA00, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_09_FLEXSPI1_A_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_10_FLEXSPI1_A_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_11_FLEXSPI1_A_DATA03, pad_config);
                    break;
                case kFlexspi1_DataA_GPIO_AD_23_20:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_20_FLEXSPI1_A_DATA00, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_21_FLEXSPI1_A_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_22_FLEXSPI1_A_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_23_FLEXSPI1_A_DATA03, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_20_FLEXSPI1_A_DATA00, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_21_FLEXSPI1_A_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_22_FLEXSPI1_A_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_23_FLEXSPI1_A_DATA03, pad_config);
                    break;
                case kFlexspi1_DataB_GPIO_SD_B2_03_00:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_00_FLEXSPI1_B_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_01_FLEXSPI1_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_02_FLEXSPI1_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_03_FLEXSPI1_B_DATA00, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_00_FLEXSPI1_B_DATA03, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_01_FLEXSPI1_B_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_02_FLEXSPI1_B_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_03_FLEXSPI1_B_DATA00, pad_config);
                    break;
                case kFlexspi1_DataB_GPIO_AD_15_12:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_12_FLEXSPI1_B_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_13_FLEXSPI1_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_14_FLEXSPI1_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_15_FLEXSPI1_B_DATA00, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_12_FLEXSPI1_B_DATA03, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_13_FLEXSPI1_B_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_14_FLEXSPI1_B_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_15_FLEXSPI1_B_DATA00, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.ss_b)
            {
                case kFlexspi1_Ss0A_GPIO_SD_B2_06:
                    MTU_USE_FSPI1_PORTA1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_06_FLEXSPI1_A_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_06_FLEXSPI1_A_SS0_B, pad_config);
                    break;
                case kFlexspi1_Ss0A_GPIO_AD_18:
                    MTU_USE_FSPI1_PORTA1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_18_FLEXSPI1_A_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_18_FLEXSPI1_A_SS0_B, pad_config);
                    break;
                case kFlexspi1_Ss1A_GPIO_SD_B1_02:
                    MTU_USE_FSPI1_PORTA2
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_02_FLEXSPI1_A_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_02_FLEXSPI1_A_SS1_B, pad_config);
                    break;
                case kFlexspi1_Ss0B_GPIO_SD_B1_04:
                    MTU_USE_FSPI1_PORTB1
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_04_FLEXSPI1_B_SS0_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_04_FLEXSPI1_B_SS0_B, pad_config);
                    break;
                case kFlexspi1_Ss1B_GPIO_AD_35:
                    MTU_USE_FSPI1_PORTB2
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_35_FLEXSPI1_B_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_35_FLEXSPI1_B_SS1_B, pad_config);
                    break;
                case kFlexspi1_Ss1B_GPIO_SD_B1_03:
                    MTU_USE_FSPI1_PORTB2
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_03_FLEXSPI1_B_SS1_B, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_03_FLEXSPI1_B_SS1_B, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.sclk)
            {
                case kFlexspi1_SclkA_GPIO_SD_B2_07:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_07_FLEXSPI1_A_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_07_FLEXSPI1_A_SCLK, pad_config);
                    break;
                case kFlexspi1_SclkA_GPIO_AD_19:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_19_FLEXSPI1_A_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_19_FLEXSPI1_A_SCLK, pad_config);
                    break;
                case kFlexspi1_SclkB_GPIO_SD_B2_04:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_04_FLEXSPI1_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_04_FLEXSPI1_B_SCLK, pad_config);
                    break;
                case kFlexspi1_SclkB_GPIO_AD_16:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_16_FLEXSPI1_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_16_FLEXSPI1_B_SCLK, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dqs0)
            {
                case kFlexspi1_DqsA_GPIO_SD_B2_05:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_05_FLEXSPI1_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_05_FLEXSPI1_A_DQS, pad_config);
                    break;
                case kFlexspi1_DqsA_GPIO_AD_17:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_17_FLEXSPI1_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_17_FLEXSPI1_A_DQS, pad_config);
                    break;
                case kFlexspi1_DqsA_GPIO_EMC_B2_18:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_EMC_B2_18_FLEXSPI1_A_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_EMC_B2_18_FLEXSPI1_A_DQS, pad_config);
                    break;
                case kFlexspi1_DqsB_GPIO_SD_B1_05:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_FLEXSPI1_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_05_FLEXSPI1_B_DQS, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dataHigh4bit)
            {
                case kFlexspi1_DataB_GPIO_SD_B2_03_00:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_00_FLEXSPI1_B_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_01_FLEXSPI1_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_02_FLEXSPI1_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_03_FLEXSPI1_B_DATA00, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_00_FLEXSPI1_B_DATA03, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_01_FLEXSPI1_B_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_02_FLEXSPI1_B_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_03_FLEXSPI1_B_DATA00, pad_config);
                    break;
                case kFlexspi1_DataB_GPIO_AD_15_12:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_12_FLEXSPI1_B_DATA03, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_13_FLEXSPI1_B_DATA02, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_14_FLEXSPI1_B_DATA01, 1U);
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_15_FLEXSPI1_B_DATA00, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_12_FLEXSPI1_B_DATA03, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_13_FLEXSPI1_B_DATA02, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_14_FLEXSPI1_B_DATA01, pad_config);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_15_FLEXSPI1_B_DATA00, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.sclk_n)
            {
                case kFlexspi1_SclkB_GPIO_SD_B2_04:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B2_04_FLEXSPI1_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B2_04_FLEXSPI1_B_SCLK, pad_config);
                    break;
                case kFlexspi1_SclkB_GPIO_AD_16:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_AD_16_FLEXSPI1_B_SCLK, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_16_FLEXSPI1_B_SCLK, pad_config);
                    break;
                default:
                    break;
            }
            switch (packet->memConnection.dqs1)
            {
                case kFlexspi1_DqsB_GPIO_SD_B1_05:
                    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B1_05_FLEXSPI1_B_DQS, 1U);
                    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B1_05_FLEXSPI1_B_DQS, pad_config);
                    break;
                default:
                    break;
            }
        }
        else if (packet->memConnection.instance == 2)
        {
        }
    }
}

void bsp_mixspi_gpios_toggle(void)
{
    if (s_pinUnittestPacket.pintestEn.enableAdcSample)
    {
        uint8_t convValue = bsp_adc_get_conv_value();
        mtu_uart_sendhex(&convValue, sizeof(convValue));
    }
  
    GPIO_Type *gpioBase[] = GPIO_BASE_PTRS;
    for (uint32_t i = 0; i < sizeof(s_pinInfo) / sizeof(pin_info_t); i++)
    {
        if (s_pinInfo[i].gpioGroup != 0xFFFFu)
        {
            GPIO_PortToggle(gpioBase[s_pinInfo[i].gpioGroup], 1u << s_pinInfo[i].gpioPin);
        }
    }
}

