JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1176/port_flexspi_info.c
void bsp_mixspi_clock_init(void *config)
{
    clock_root_config_t rootCfg = {0};
    mixspi_user_config_t *userConfig = (mixspi_user_config_t *)config;
    mixspi_root_clk_freq_t clkFreq = userConfig->mixspiRootClkFreq;
    if (userConfig->mixspiBase == FLEXSPI1)
    {
        userConfig->instance = 1;
        // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 12-35.
        if (clkFreq == kMixspiRootClkFreq_30MHz)
        {
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc48MDiv2;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_50MHz)
        {
            /* Init System Pll2 (528MHz) pfd2. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            // CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd2, 24);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd2;
            rootCfg.div = 8;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_60MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 18);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 8;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_80MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 18);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 6;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_100MHz)
        {
            /* Init System Pll2 (528MHz) pfd2. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            // CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd2, 24);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd2;
            rootCfg.div = 4;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_120MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 18);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 4;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_133MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            //CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 13);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 5;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_166MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            //CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 13);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 4;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_200MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 22);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_240MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 18);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_266MHz)
        {
            /* Init System Pll2 (528MHz) pfd2. */
            // 528*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys2, kCLOCK_Pfd2, 18);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd2;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_332MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            //CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 13);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 2;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else if (clkFreq == kMixspiRootClkFreq_400MHz)
        {
            /* Init System Pll3 (480MHz) pfd0. */
            // 480*18/PFDx_FRAC where PFDx_FRAC is in the range 13-35.
            CLOCK_InitPfd(kCLOCK_PllSys3, kCLOCK_Pfd0, 22);
            rootCfg.mux = kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0;
            rootCfg.div = 1;
            CLOCK_SetRootClock(kCLOCK_Root_Flexspi1, &rootCfg);
        }
        else
        {
            printf("FLEXSPI1 clock freq is not set.\r\n");
        }

        uint32_t flexspiClk = CLOCK_GetRootClockFreq(kCLOCK_Root_Flexspi1);
        if (flexspiClk > 166000000U)
        {
            __NOP();
        }
    }
    else if (userConfig->mixspiBase == FLEXSPI2)
    {
        userConfig->instance = 2;
    }
    else
    {
    }
}

uint32_t bsp_mixspi_get_clock(void *config)
{
    mixspi_user_config_t *userConfig = (mixspi_user_config_t *)config;
    if (userConfig->mixspiBase == FLEXSPI1)
    {
        return CLOCK_GetRootClockFreq(kCLOCK_Root_Flexspi1);
    }
    else if (userConfig->mixspiBase == FLEXSPI2)
    {
        return CLOCK_GetRootClockFreq(kCLOCK_Root_Flexspi2);
    }
    else
    {
        return 0;
    }
}

void bsp_mixspi_clock_source(void *config)
{
    mixspi_user_config_t *userConfig = (mixspi_user_config_t *)config;
    uint32_t index = 0;
    clock_root_t root;
    uint32_t clkSel;
    if (userConfig->mixspiBase == FLEXSPI1)
    {
        root = kCLOCK_Root_Flexspi1;
        clkSel = CLOCK_GetRootClockMux(root);
        switch (clkSel)
        {
            case kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc48MDiv2:
                printf("FLEXSPI1 Clk Source from 3'b000 - OSC RC48M Div2 clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_OscRc48MDiv2));
                break;

            case kCLOCK_FLEXSPI1_ClockRoot_MuxOsc24MOut:
                printf("FLEXSPI1 Clk Source from 3'b001 - OSC RC24M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_Osc24MOut));
                break;

            case kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc400M:
                printf("FLEXSPI1 Clk Source from 3'b010 - OSC RC400M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_OscRc400M));
                break;

            case kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc16M:
                printf("FLEXSPI1 Clk Source from 3'b011 - OSC RC16M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_OscRc16M));
                break;

