JayHeng/imxrt-flexspi-mem-fw/boards/mimxrt/mtu_fw/imxrt1176/port_flexspi_info.c
            case kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0:
                printf("FLEXSPI1 Clk Source from 3'b100 - Sys PLL3 PFD0 clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_SysPll3Pfd0));
                break;

            case kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Out:
                printf("FLEXSPI1 Clk Source from 3'b101 - Sys PLL2 clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_SysPll2));
                break;

            case kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd2:
                printf("FLEXSPI1 Clk Source from 3'b110 - Sys PLL2 PFD2 clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_SysPll2Pfd2));
                break;

            case kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Out:
                printf("FLEXSPI1 Clk Source from 3'b111 - Sys PLL3 clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_SysPll3));
                break;

            default:
                break;
        }
    }
    else if (userConfig->mixspiBase == FLEXSPI2)
    {
        root = kCLOCK_Root_Flexspi2;
        clkSel = CLOCK_GetRootClockMux(root);
        switch (clkSel)
        {
            case kCLOCK_FLEXSPI2_ClockRoot_MuxOscRc48MDiv2:
                printf("FLEXSPI2 Clk Source from 3'b000 - OSC RC48M Div2 clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_OscRc48MDiv2));
                break;

            case kCLOCK_FLEXSPI2_ClockRoot_MuxOsc24MOut:
                printf("FLEXSPI2 Clk Source from 3'b001 - OSC RC24M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_Osc24MOut));
                break;

            case kCLOCK_FLEXSPI2_ClockRoot_MuxOscRc400M:
                printf("FLEXSPI2 Clk Source from 3'b010 - OSC RC400M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_OscRc400M));
                break;

            case kCLOCK_FLEXSPI2_ClockRoot_MuxOscRc16M:
                printf("FLEXSPI2 Clk Source from 3'b011 - OSC RC16M clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_OscRc16M));
                break;

            case kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd0:
                printf("FLEXSPI2 Clk Source from 3'b100 - Sys PLL3 PFD0 clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_SysPll3Pfd0));
                break;

            case kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Out:
                printf("FLEXSPI2 Clk Source from 3'b101 - Sys PLL2 clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_SysPll2));
                break;

            case kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd2:
                printf("FLEXSPI2 Clk Source from 3'b110 - Sys PLL2 PFD2 clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_SysPll2Pfd2));
                break;

            case kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Out:
                printf("FLEXSPI2 Clk Source from 3'b111 - Sys PLL3 clock %dHz.\r\n", CLOCK_GetFreq(kCLOCK_SysPll3));
                break;

            default:
                break;
        }
    }
    else
    {
    }
    index = (root - kCLOCK_Root_Flexspi1) + 1;
    uint32_t clkDiv = CLOCK_GetRootClockDiv(root);
    printf("FLEXSPI%d Clk Source Divider: %d.\r\n", index, clkDiv);
    printf("FLEXSPI%d Clk Frequency: %dHz.\r\n", index, bsp_mixspi_get_clock(userConfig));
}

void bsp_mixspi_sw_delay_us(uint64_t us)
{
    uint32_t ticks_per_us = CLOCK_GetFreq(kCLOCK_CpuClk) / 1000000;
    while (us--)
    {
        register uint32_t ticks = 1 + ticks_per_us / 4;
        while (ticks--)
        {
            __NOP();
        }
    }
}

uint32_t bsp_mixspi_get_amba_base(void *config)
{
    mixspi_user_config_t *userConfig = (mixspi_user_config_t *)config;
    if (userConfig->mixspiBase == FLEXSPI1)
    {
        return FlexSPI1_AMBA_BASE;
    }
    else if (userConfig->mixspiBase == FLEXSPI2)
    {
        return FlexSPI2_AMBA_BASE;
    }
    else
    {
        return 0;
    }
}
